app/controllers/admin/customers_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "customers" SET "postcode" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["postcode", "0123456"], ["updated_at", "2021-09-17 02:16:39.010654"], ["id", 1]]
---
  def update
    @customer = Customer.find(params[:id])
    @customer.update(admin_customer_params)