app/views/orders/confirm.html.erb

          <!--小計の計算-->
          <% subtotal = (cart_item.item.price * 1.1).round * cart_item.count %>
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]