app/views/cart_items/index.html.erb

          <td><%= cart.count %></td>
          <td><%= cart.item.price * cart.count %></td>
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]