app/views/cart_items/index.html.erb

  <div class="row">
    <% if current_customer.cart_items.blank? %>
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]