app/controllers/cart_items_controller.rb

  def create
    @cart_item = current_customer.cart_items.new(cart_item_params)
    @cart_item.customer_id = current_customer.id
    if current_customer.cart_items.find_by(item_id: params[:cart_item][:item_id]).present?
      cart_item = current_customer.cart_items.find_by(item_id: params[:cart_item][:item_id])
      @count = @cart_item.count + cart_item.count
      cart_item.update(count: @count)
      redirect_to cart_items_url(@cart_item.customer)
    elsif
      @cart_item.save
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["customer_id", 1], ["item_id", 1], ["LIMIT", 1]]
INSERT INTO "cart_items" ("customer_id", "item_id", "count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["customer_id", 1], ["item_id", 1], ["count", 3], ["created_at", "2021-09-16 08:29:48.909925"], ["updated_at", "2021-09-16 08:29:48.909925"]]

  def update
    @cart_item = current_customer.cart_items.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @cart_item = current_customer.cart_items.find_by(params[:id])
    @cart_item.destroy
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ? AND (1) LIMIT ?  [["customer_id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 10]]