app/controllers/customers_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "customers" SET "is_deleted" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_deleted", 1], ["updated_at", "2021-09-16 13:42:06.086970"], ["id", 2]]
---
  def leave
    @customer = Customer.find(params[:id])
    @customer.update(is_deleted: true)