app/controllers/delivery_places_controller.rb

  def edit
    @delivery_place = DeliveryPlace.find(params[:id])
---
SELECT  "delivery_places".* FROM "delivery_places" WHERE "delivery_places"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def create
    @delively_place = DeliveryPlace.new(delivery_params)
    @delively_place.customer_id = current_customer.id
    @delively_place.save
---
INSERT INTO "delivery_places" ("customer_id", "addressee", "postcode", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 1], ["addressee", "甘党花子"], ["postcode", "1234567"], ["address", "東京都"], ["created_at", "2021-09-15 13:50:34.854921"], ["updated_at", "2021-09-15 13:50:34.854921"]]

  def update
    @delivery_place = DeliveryPlace.find(params[:id])
    @delivery_place.update(delivery_params)
---
SELECT  "delivery_places".* FROM "delivery_places" WHERE "delivery_places"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "delivery_places" SET "postcode" = ?, "updated_at" = ? WHERE "delivery_places"."id" = ?  [["postcode", "0000000"], ["updated_at", "2021-09-16 04:50:32.812151"], ["id", 4]]

  def destroy
    @delivery_place = DeliveryPlace.find(params[:id])
    @delivery_place.destroy
---
SELECT  "delivery_places".* FROM "delivery_places" WHERE "delivery_places"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "delivery_places" WHERE "delivery_places"."id" = ?  [["id", 2]]