app/controllers/items_controller.rb

  def index
    @items = Item.all.page(params[:page]).per(8)
---
SELECT COUNT(*) FROM "items"