app/controllers/orders_controller.rb

  def confirm
    @order = Order.new
    @customer = current_customer
    @order.customer_id = @customer.id
    @new_place = DeliveryPlace.new
    @new_place.customer_id = @customer.id
    @order.payment_method = params[:payment_method]
    @order.postage = 800
    @cart_items = @customer.cart_items
    @sum = 0

    if params[:place_option] == "0"
      @order.postcode = @customer.postcode
      @order.address = @customer.address
      full_name = @customer.last_name + @customer.first_name
      @order.addressee = full_name

    elsif params[:place_option] == "1"
      @sta = params[:order_place]
      @order_place = DeliveryPlace.find(@sta)
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ? LIMIT ?  [["customer_id", 1], ["LIMIT", 11]]
SELECT  "delivery_places".* FROM "delivery_places" WHERE "delivery_places"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def create
    # 注文の保存
      @order = Order.new(order_params)
      @order.save
      if @order.invalid?
        render :new
      end
    # 注文商品の保存
      @cart_items = current_customer.cart_items.all
      @cart_items.each do |cart_item|
        @order_items = @order.order_items.new
        @order_items.order_id = @order.id
        @order_items.item_id = cart_item.item.id
        @order_items.count = cart_item.count
        @order_items.price = cart_item.item.price
        @order_items.save
      end

      # カートアイテムの削除
      @cart_items.destroy_all
---
INSERT INTO "orders" ("created_at", "updated_at", "customer_id", "total_price", "payment_method", "postage", "addressee", "postcode", "address") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
INSERT INTO "order_items" ("created_at", "updated_at", "order_id", "item_id", "count", "price") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2021-09-17 07:05:58.565972"], ["updated_at", "2021-09-17 07:05:58.565972"], ["order_id", 12], ["item_id", 5], ["count", 1], ["price", 360]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 17]]